# readArraySet = {"ふといながねぎ","あじわいキノコ","とくせんエッグ","ほっこりポテト","とくせんリンゴ","げきからハーブ","マメミート","モーモーミルク","あったかジン","あまいミツ","ピュアなオイル","あんみんトマト","リラックスカカオ","ワカクサ大豆","ワカクサコーン","めざましコーヒー"}
# readNumberは読み取り用の文字列のリストであり、その文字列に対応するingDataのindexを返すものでもある
# 
readNumber = {
  "ふといながねぎ":0,
  "あじわいキノコ":1,
  "とくせんエッグ":2,
  "ほっこりポテト":3,
  "とくせんリンゴ":4,
  "げきからハーブ":5,
  "マメミート":6,
  "モーモーミルク":7,
  "あまいミツ":8,
  "ピュアなオイル":9,
  "あったかジン":10,
  "あんみんトマト":11,
  "リラックスカカオ":12,
  "おいしいシッポ":13,
  "ワカクサ大豆":14,
  "ワカクサコーン":15,
  "めざましコーヒー":16
}
ingDataInitial = [0] * 17